typedef struct {
  vtable_generic_marginpopup* vtable_typed; // 0
  void* field_4; // 4
  void* field_8; // 8
  __string _name; // 12
  void* _prev; // 40
  void* _next; // 44
  void* vbtable; // 48
  char paths_and_mutex_junk[48]; // 52
  void* _state; // 100
  TransformState* _transform; // 104
  TransformState* _prev_transform; // 108
  void* _effects; // 112
  char tag_junk[48]; // 116
  int _draw_control_mask; // 164
  int _draw_show_mask; // 168
  int _into_collide_mask; // 172
  int _bounds_type; // 176
  void* _user_bounds; // 180
  int _final_bounds; // 184
  int _fancy_bits; // 188
  int _net_collide_mask; // 192
  int _net_draw_control_mask; // 196
  int _net_draw_show_mask; // 200
  void* _off_clip_planes; // 204
  int _nested_vertices; // 208
  void* _external_bounds; // 212
  int _last_update; // 216
  int _next_update; // 220
  void* _down; // 224
  void* _stashed; // 228
  void* _up; // 232

  int m_seq; // 236
  NodePath m_np; // 240
  char m_managed; // 252
  char m_visible; // 253
  char __padding_2[2]; // 254
  vtable_generic_clickablepopup* vtable_margin_or_cell_width; // 256
  void* field_260; // 260
  int m_state; // 264
  int m_culled; // 268
  float m_time; // 272
  void* field_276; // 276
  __string m_text; // 280
  TextFont* m_font; // 308
  int m_type; // 312
  NodePath m_np_balloon; // 316
  int m_clickable; // 328
  __string m_avname; // 332
  int m_avid; // 360
  int m_is_player_id; // 364
  MouseWatcherRegion* m_region; // 368
  void* m_mouse_watcher; // 372
  vtable_generic_refcount* vtable_refcount; // 376
  int refcount; // 380
  void* weak_ptr_list; // 384
} WhisperPopup;
